backend/app/controllers/bet_controller.rb

    def index
        bets = Bet.all

        bets_array = []
        bets.each do |bet|
            bets_array.push({
                bet_id: bet.id,
                event_id: bet.event_id,
                match: Event.find(bet.event_id).match_kind,
                date: Event.find(bet.event_id).date,
                office: bet.office,
                kind: bet.kind,
                ratio: bet.ratio,
                attr_1: bet.attr_1,
                attr_3: bet.attr_3
            })
---
SELECT "bets".* FROM "bets"
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]