backend/app/controllers/parser_controller.rb

                    final_date = Time.parse(date_from_parimatch[0], final_date)
                    teams = data.css('tr td a.om').children.to_s.split('<br>')

                    events_from_parimatch = Event.new(date: final_date,
                                                      home_team: teams[0],
                                                      guest_team: teams[1],
                                                      match_kind: doc.css('div#z_container div#z_contentw div#oddsList div.container h3').text.delete(' ')
                                                    )

                    if find_event_in_database(events_from_parimatch.date, events_from_parimatch.match_kind, events_from_parimatch.home_team, events_from_parimatch.guest_team).nil?
                        events_from_parimatch.save
                        @event_id = Event.last.id
---
DELETE FROM "events"
INSERT INTO "events" ("date", "match_kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2019-02-23 14:30:00 +0300"], ["match_kind", "Хоккей.КХЛ"], ["created_at", "2019-02-22 13:07:02.487817"], ["updated_at", "2019-02-22 13:07:02.487817"]]
SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 1]]

                            array_attributes.push(get_attr)
                        end
                        if (array_attributes.size%2 == 0)
                            total_for_event = Bet.new(event_id: @event_id,
                                                      kind: "total", #data.search('tr:nth-child(12)').search('td:nth-child(2)').search('tr:nth-child(1)').text,
                                                      office: "parimatch",
                                                      ratio: array_attributes[1],
                                                      attr_1: Bet.last.attr_1,
                                                      attr_3: array_attributes[0]
                                                    )
                            total_for_event.save
                        else
                            total_for_event = Bet.new(event_id: @event_id,
                                                      kind: "total", #data.search('tr:nth-child(12)').search('td:nth-child(2)').search('tr:nth-child(1)').text,
                                                      office: "parimatch",
                                                      ratio: array_attributes[2],
                                                      attr_1: array_attributes[0].gsub!(/[^0-9,.]/,''),
                                                      attr_3: array_attributes[1]
                                                    )
---
SELECT  "bets".* FROM "bets" ORDER BY "bets"."id" DESC LIMIT $1  [["LIMIT", 1]]

    def parse_leon
        browser = Watir::Browser.new

        event_data = []
        bet_data = []
        browser.goto('https://www.leon.ru/events/IceHockey/562949953432733-Russia-MHL')

        browser.is(class: /material-icons keyboard_arrow_down/).each do |icon|
            icon.click
            sleep(0.4)

            doc = Nokogiri::HTML(browser.html)
            doc.encoding = 'utf-8'

            #достаю только раскрытые блоки в цикле, все остальные игнорируются
            doc.css('div.content div.fon div.body div.main span').each do |main|
                main.css('li.expanded').each do |data|
                        time = data.search('div:nth-child(1)').search('div:nth-child(1)').search('span:nth-child(1)').search('div:nth-child(1)').text
                        date = data.search('div:nth-child(1)').search('div:nth-child(1)').search('span:nth-child(1)').search('div:nth-child(2)').text
                        final_time = Time.parse time + " " + date
                        teams = data.search('div:nth-child(1)').search('div:nth-child(2)').search('div:nth-child(1)').search('a:nth-child(1)').search('span:nth-child(1)').text.split(' - ')

                        event_data = Event.new(
                                            date: final_time,
                                            home_team: teams[0],
                                            guest_team: teams[1],
                                            match_kind: main.css('div.head-title div.middle a').text.strip.delete(' ').gsub(/-.*-/, '.')
                                            )

                        if find_event_in_database(event_data.date, event_data.match_kind, event_data.home_team, event_data.guest_team).nil?
                            event_data.save
                            @event_id = Event.last.id
---
INSERT INTO "events" ("date", "match_kind", "created_at", "updated_at", "home_team", "guest_team") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 1]]

                                        attr_1: get_total_with_min_max[1].gsub!(/[^0-9,.]/,''),
                                        attr_3: get_total_with_min_max[0].mb_chars.downcase.to_s
                                        )
                        bet_data.save
---
INSERT INTO "bets" ("event_id", "office", "kind", "ratio", "attr_1", "attr_3", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def find_event_in_database(final_date, match_kind, home_team, guest_team)
        get_events = Event.where(match_kind: match_kind, date: final_date)
        if get_events.empty?
            return
        elsif
            get_events.collect do |event|
---
SELECT "events".* FROM "events" WHERE "events"."match_kind" = $1 AND "events"."date" = $2  [["match_kind", "Хоккей.МХЛ"], ["date", "2019-03-04 17:00:00 +0300"]]
SELECT  1 AS one FROM "events" WHERE "events"."match_kind" = $1 AND "events"."date" = $2 LIMIT $3  [["match_kind", "Хоккей.МХЛ"], ["date", "2019-03-04 19:00:00 +0300"], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."match_kind" = $1 AND "events"."date" = $2  [["match_kind", "Хоккей.МХЛ"], ["date", "2019-03-04 19:00:00 +0300"]]